kouhei1970/m5stamp_uwb_localizer/firmware/tag/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# --- メインタスクのスタック（重要）---
# 測位ループは app_main のタスク上で回る（main.cpp）。uwb_loc の EKF は
# uwb_ekf_update() -> uwb_ekf_predict() の連鎖で 9x9 double 行列を複数
# スタックに置き（配列だけで約 3.5KB）、Lv0/Lv2 経路も約 2KB 使う。
# ESP-IDF 既定の 3584 バイトでは溢れて panic リブートする。
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288

# --- FreeRTOS tick = 1000Hz（重要）---
# firmware/twr, firmware/anchor と同じ理由。requestRange()/requestDSRange() が
# 内部で dwt_setdelayedtrxtime() による遅延送信を使うため、ESP-IDF既定の
# 100Hzのままだと vTaskDelay(pdMS_TO_TICKS(1)) が10ms刻みになり送信ウィンドウを
# 取り逃す恐れがある（docs/archive/PROGRESS.md Phase 2 Step 1 参照）。
CONFIG_FREERTOS_HZ=1000

# --- ESP32-S3 専用最適化（本リポジトリは ESP32-S3 + M5Stack UWB 専用）---
# 既定の CONFIG_COMPILER_OPTIMIZATION_DEBUG は -Og でビルドされる。
# 測位計算（uwb_loc）は演算律速なので -O2 にする。
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# ESP32-S3 は 240MHz 対応。既定の 160MHz からそのまま 1.5 倍になる。
# 電池駆動で消費電力が問題になる場合はここを戻すこと。
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# --- パーティションテーブル（NVS 必須）---
# components/uwb_cfgstore が設定を NVS へ保存する。ESP-IDF 既定の
# partitions_singleapp.csv にも nvs は含まれているが、「nvs が必須である」ことを
# リポジトリ内で明示するため独自ファイルにしてある（配置は既定と同一）。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- コンソールを USB-Serial/JTAG にする ---
# M5StampS3A / M5 AtomS3 は USB-UART ブリッジを持たず、USB-C は ESP32-S3 内蔵の
# USB-Serial/JTAG に直結している。ESP-IDF の既定（UART0 が一次コンソール、
# USB-Serial/JTAG は出力専用の二次コンソール）のままだと、ログは USB から見えるが
# **キー入力を受け取れない**ためシリアルコンソールが機能しない。
# 一次コンソールを USB-Serial/JTAG にすることで esp_console_new_repl_usb_serial_jtag()
# が使えるようになる。UART0 のピン(GPIO43/44)へは出力されなくなるが、これらの
# ボードでは元々その先に何も繋がっていない。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- uwb_net（Wi-Fi + ブラウザダッシュボード + 無線コンソール）---
# scratchpad/NET_SPEC.md §7。

# M5StampS3A は 8MB フラッシュ（esptool flash_id で実測確認済み）。factory
# パーティションを 1M -> 3M に広げる（partitions.csv）ためフラッシュ側の
# 上限も合わせて広げる。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# ブラウザダッシュボードの WebSocket ("/ws") に必須。
CONFIG_HTTPD_WS_SUPPORT=y
# esp_http_server が受け付けるリクエストヘッダの上限。既定値のままだと
# 一部ブラウザが付ける長いヘッダ（Sec-WebSocket-Extensions 等）で
# ハンドシェイクが弾かれることがあるため広げる。
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# lwIP の同時ソケット数上限。HTTPサーバ(最大6接続)+UDP(1)+TCPコンソール
# (listen1+accept1)+mDNS が同時に開く分の余裕を見て既定の10から増やす。
CONFIG_LWIP_MAX_SOCKETS=16
# lwIP の TCP/IPタスクをコア0に固定する（uwb_net の各タスクと同じコア。
# UWBの電波を扱うタスク（コア1）に持ち込まないため）。
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y
# Wi-Fiドライバの内部タスクもコア0に固定する（同上の理由）。
CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_0=y

# 測距1本ごとの逐次EKF更新 (Lv3) を既定で有効にする / enable sequential EKF by default
CONFIG_UWB_TAG_ENABLE_EKF=y
